content/main/20211008134350-artist.md
+++
title = "Artist"
author = ["System Administrator"]
draft = false
+++

I have the gut to say, that I am a artist right here, right now.
Long way to go, but I am doing art and creation.


## Projects {#projects}


### ACTIVE Musical Actor {#active-musical-actor}

I am doing [The Greatest Show]({{< relref "20210929010628-projects#the-greatest-show" >}}).


#### Musical Club {#musical-club}

<!--list-separator-->

-  ACTIVE The Greatest Show

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Stage Motion

        follow [Greatest Sqqqhow Stage Motion](/ox-hugo/1633853013086851.mp4)

        <!--list-separator-->

        -  1. Before &amp; Graph 1

        <!--list-separator-->

        -  2. My opening

        <!--list-separator-->

        -  3. See See

        <!--list-separator-->

        -  4. Showing Huang &amp; Graph 2

        <!--list-separator-->

        -  5. Grpah 3 and cycle

        <!--list-separator-->

        -  6. Go to the Piano and Play

            <!--list-separator-->

            - <span class="org-todo done DONE">DONE</span>  WEEK Gotta prepare the piano session

        <!--list-separator-->

        -  7. Finish Piano and back wave and Sing Catch phrase

        <!--list-separator-->

        -  8. get in line again

        <!--list-separator-->

        -  9. Back to Piano and Gliss the final note.

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Rehearsal

        PB221

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  Appraisal


### ACTIVE Style Copy Project {#active-style-copy-project}

Mainly using [Copy Machine]({{< relref "20211022163703-copy_machine.md" >}})'s drawing aspect.


#### Meta {#meta}

-   Model: _村上水军_
-   Current Loop: 1


#### Problems {#problems}


#### <span class="org-todo done DONE">DONE</span> 1. Practice {#1-dot-practice}

<!--list-separator-->

-  Machine

    [Drawing Machine]({{< relref "20211022221443-drawing_machine.md" >}})


#### <span class="org-todo done DONE">DONE</span> 2. Compare and find problem {#2-dot-compare-and-find-problem}

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  How to draw pieces of Hair

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Highlight on hair

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Eye's change of shape when head rotated

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  How to represent nose

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Where is nose

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  how to illustrate mouth

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Shoulder Joint

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Butt Joint

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  How to illustrate the neck body joint

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Shape of head, in perspective

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Representation of Knee

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Real world shoes and leg-foot joint

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Use of shadows to highlight the space and shape of body

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Highlight's use

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  The radius of arm and leg, and body


#### <span class="org-todo todo TODO">TODO</span> 3. Drill on 1 problem {#3-dot-drill-on-1-problem}

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Eyes' position and shape

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  What's the shape of eyes

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  Assosaries of eyes

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  How the shape of eyes change in the different perspective

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  How to render the eye details

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  Where shold eyes be placed


#### <span class="org-todo todo TODO">TODO</span> 4. Return to Practice {#4-dot-return-to-practice}


### ACTIVE Keyboard Band {#active-keyboard-band}


#### <span class="org-todo todo TODO">TODO</span> Training {#training}

at G13W


## Learning {#learning}

I've been thinking if I should nest the topic under project, or stand alone.
Plus, or under different aspects of artist, like writer/drawer


### Writing {#writing}


#### Franklin Method {#franklin-method}

1.  Take a paragraph.
2.  Write it.
3.  Compare to the original one.


### Drawing {#drawing}


#### Workflow Speci {#workflow-speci}

The WorkFolder is under `~/Ultra Projects/Ultra Draw/Drawabox`


#### Drawabox {#drawabox}

Drawabox is a website with a bunch of progressive drills and concepts about drawing
After trying it, I think it's a very good progress line to follow.
I'm taking a drawabox exercise each day before doing anything to remember the grinding work of life.

<!--list-separator-->

-  Process

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  Boxes


#### Other Drills {#other-drills}

<!--list-separator-->

-  Copy Machine

<!--list-separator-->

-  Drafting (exclusive)


### Model {#model}

Using Blender


### Jazz Piano {#jazz-piano}

Jazz Piano!
Herbie Hancock's having a master class
Peter Martin's got his tutorial too


### Blues Harp {#blues-harp}

WILL WILDE's got very excellent style and tech in Harp
[Wilde's Tutorial on Bili](https://www.bilibili.com/video/BV1Mv411T7in?p=1&share_medium=ipad&share_plat=ios&share_source=COPY&share_tag=s_i&timestamp=1628933816&unique_k=4NKTBH)


### Sing {#sing}


## Aspects {#aspects}


### Jazz piano {#jazz-piano}


#### Tutorial(my) {#tutorial--my}

<!--list-separator-->

-  Section 1: the composition

    Jazz piano is not self completing. To play good jazz piano, you need to play at least 1 other instrumment. Bass, Harp, and Guitar are usually popular choices. Drum is not always a popular second instrument, but it's also a good one.

    One reason you need another instrument is that Jazz music is of interaction. Piano's having very unique logic, you need to understand other instrument. A good way is to play one.

    Another good reason is that, piano's logic is kind of disguising. You could play 7 or 8 notes together, all the sounds, without knowing them. A Bass, on the other hand, plays only base and its own solo, Harp too. The switch of logic provide comparison that could guide you to avoid unconscious playing, and make things more fun.


#### Database(songs) {#database--songs}


### Singer {#singer}


#### Database(songs) {#database--songs}

<!--list-separator-->

-  Besame Mucho

    <!--list-separator-->

    -  Lyrics

        bésame, bésame mucho,

        como si fuera esta noche la última vez,

        bésame, bésame mucho,

        que tango miedo a perderte perderte después

        bésame, bésame mucho,

        como si fuera esta la última vez,

        bésame, bésame mucho,

        que tango miedo a perderte, perderte después

        quiero tenerte muy cerca mirarme en tus ojos verte junto a mí

        piensa que tal vez mañana yo ya estaré lejos, muy lejos deti

        bésame, bésame mucho

        como si fuera esta noche la última vez.

        bésame, bésame mucho

        que tango miedo a perderte, perderte después

    <!--list-separator-->

    -  Harmony

        On G, but alt 3.(3 b on G)
        A -

<!--list-separator-->

-  Hotel California

    <!--list-separator-->

    -  Lyrics

        On a dark desert highway

        Cool wind in my hair

        Warm smell of colitas

        Rising up through the air

        Up ahead in the distance

        I saw a shimmering light

        my head grew heavy and my sight grew dim

        I had to stop for the night

        There she stood in the doorway

        I heard the mission bell

        ANd I was thinking to myself this could be heaven or this could be hell

        Then she lit up a candle

        And she showed me the way.

        There were voices down the corridor,

        I thought I head them say

<!--list-separator-->

-  Sweet Vitory